# Analysis of  Trends in the Film Industry


## 1. Business Understanding 

### (a) Introduction

The film industry also known as the motion picture industry,comprises of both the technological and the commercial institutions of filmmaking.This includes film production companies,film studios,cinematography,animation,film production,screenwriting,pre-production,post-production,actors etc.

The motion picture industry which originally began in the late 19th century,has quickly become one of the largest growing industries in the world.In 2019,the global box office was worth $42.2 billion and when including box office and home entertainment revenue the global film industry was worth $136 billion in 2018.

With the presence of vast amounts data in the film industry today,exploratory data analysis is crucial in making insightful decisions on the type of field to venture in.This project aims to provide insights for the Microsoft Corporation as they plan to create a new movie studio.By analyzing data and current trends in the film industry, we can provide valuable information to help guide their decision making process.Our goal is to help the head of the Microsoft's new movie studio to make informed decisions on what type of films to make.

This project will invole analyzing data from various sources,including research on successful movie studios and their strategies on creating successful films.Based on the analysis we will be able to provide recommendations to the Microsoft Cooporation on what types of films to produce inorder to have the best shot at success.

### (b) Problem Statement

Microsoft Cooporation is planning to create a new movie studio and want to determine which films to produce inorder to maximize their chance for success.To do this,an exploratory data analysis needs to be carried out to identify various trends and patterns in the current movie industry.The goal of this project is to use some data analysis techniques inorder to come up with insights and recommendations on what type of films the Cooporation should make.This will involve analysis on the box office peformance, genre trends and how different films have been received by the audience.This analysis will help the head of Microsoft's new movie studio make informed decisions on their film production strategy.

### (c) Defining the metric of success

This project will considered a success if:

-   It can yield atleast three actionable recommendations towards increasing box office revenue by 30%

### (d) Main Objective

To come up with insights and atleast three recommendations to help the head of Microsoft's new movie studio make data-driven decisions on what type of films to make.

### (e) Specific Objectives

-   Conduct exploratory data analysis to identify the trends and patterns for the different movie genres 
    and visualize the data using bar graphs.
-   Analyze the data to identify key drivers of film success by investigating how different variables in 
    the dataset influece the success of a film.
-   Generate insights and recommendations based on the analysis of the data

### (f) Recording the Experimental design

-   **Reading and checking the data** - This stage involves reviewing the data layout and checking for any missing values in the data.
-   **Cleaning the data** - This stage involves removing duplicated records,handling missing data,correcting inconsistencies in data and removing outliers and irrelevant data.
-   **Exploratory data analysis** - This stage involves visualizing data by using graphs,calculating summary statistics,identifying correlations and examining data distribution.
-   **Conclusions and recommendation** - This stage involves using the analysis of the data to generate insights and recommendation for Microsoft's new film studio concerning what films to make.

### (g) Data Relevance

The data sources for this analysis will be pulled from three separate files

#### tmdb.movies.csv

This dataset is a csv file that has 26517 rows and 9 columns.Each row represents the a particular movie with the columns having a specific attribute of that movie.
This dataset will help in determining the relationship between the popularity,the vote count, and the vote average of each movie inorder to make insights on whether the vote count and the vote average have anything to do with its popularity.



#### title.basics.csv

This dataset is a CSV file containing 146144 rows and 6 columns.Each row represents a particular movie, its primary and original title,start year,run time in minutes and its genre.
This dataset will help in identifying the genres that are produced more frequently .

#### tn.movie_budgets.csv

This dataset is a CSV file containing 5782 rows and 6 columns.Each row represents a movie,its release date,its production budget,its domestic and worldwide gross.
This dataset will help in comparing the budget of the movies that have been successful and see whether the budget of the movie has any relationship with its financial success.

## 2. Reading Data

In [58]:
#importing the necessary libraries

import seaborn as sns 
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np

%matplotlib inline

In [59]:
#loading the movies csv into a dataframe

movies = pd.read_csv("Datasets/tmdb.movies.csv", index_col=0)

In [60]:
#loading the title basics csv into a dataframe

title_basics = pd.read_csv("Datasets/title.basics.csv")

In [61]:
#loading the movies budgets csv into a dataframe

movie_budgets = pd.read_csv("Datasets/tn.movie_budgets.csv")

## 3. Checking the data

In [62]:
#checking the first 5 rows of the movies dataframe

movies.head()

,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186

In [63]:
#checking the last 5 rows of the movies dataframe

movies.tail()

,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
26512,"[27, 18]",488143,en,Laboratory Conditions,0.6,2018-10-13,Laboratory Conditions,0.0,1
26513,"[18, 53]",485975,en,_EXHIBIT_84xxx_,0.6,2018-05-01,_EXHIBIT_84xxx_,0.0,1
26514,"[14, 28, 12]",381231,en,The Last One,0.6,2018-10-01,The Last One,0.0,1
26515,"[10751, 12, 28]",366854,en,Trailer Made,0.6,2018-06-22,Trailer Made,0.0,1
26516,"[53, 27]",309885,en,The Church,0.6,2018-10-05,The Church,0.0,1

In [64]:
#printing the general information ot the movies dataframe

movies.info()

<class 'pandas.core.frame.DataFrame'>
Index: 26517 entries, 0 to 26516
Data columns (total 9 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   genre_ids          26517 non-null  object
 1   id                 26517 non-null  int64
 2   original_language  26517 non-null  object
 3   original_title     26517 non-null  object
 4   popularity         26517 non-null  float64
 5   release_date       26517 non-null  object
 6   title              26517 non-null  object
 7   vote_average       26517 non-null  float64
 8   vote_count         26517 non-null  int64
dtypes: float64(2), int64(2), object(5)
memory usage: 2.0+ MB

In [65]:
#checking the first 5 rows of the title basics dataframe

title_basics.head()

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"

In [66]:
#checking the last 5 rows of the title basics dataframe


title_basics.tail()

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
146139,tt9916538,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,2019,123.0,Drama
146140,tt9916622,Rodolpho Teóphilo - O Legado de um Pioneiro,Rodolpho Teóphilo - O Legado de um Pioneiro,2015,NaN,Documentary
146141,tt9916706,Dankyavar Danka,Dankyavar Danka,2013,NaN,Comedy
146142,tt9916730,6 Gunn,6 Gunn,2017,116.0,NaN
146143,tt9916754,Chico Albuquerque - Revelações,Chico Albuquerque - Revelações,2013,NaN,Documentary

In [67]:
#checking the general information of the title basics dataframe

title_basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146144 entries, 0 to 146143
Data columns (total 6 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   tconst           146144 non-null  object
 1   primary_title    146143 non-null  object
 2   original_title   146122 non-null  object
 3   start_year       146144 non-null  int64
 4   runtime_minutes  114405 non-null  float64
 5   genres           140736 non-null  object
dtypes: float64(1), int64(1), object(4)
memory usage: 6.7+ MB

In [68]:
#checking the first 5 rows of the movie budgets dataframe

movie_budgets.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [69]:
#checking the last 5 rows of the movie budgets dataframe

movie_budgets.tail()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
5777,78,"Dec 31, 2018",Red 11,"$7,000",$0,$0
5778,79,"Apr 2, 1999",Following,"$6,000","$48,482","$240,495"
5779,80,"Jul 13, 2005",Return to the Land of Wonders,"$5,000","$1,338","$1,338"
5780,81,"Sep 29, 2015",A Plague So Pleasant,"$1,400",$0,$0
5781,82,"Aug 5, 2005",My Date With Drew,"$1,100","$181,041","$181,041"

In [70]:
#printing the general information of the movie budgets dataframe

movie_budgets.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5782 non-null   int64
 1   release_date       5782 non-null   object
 2   movie              5782 non-null   object
 3   production_budget  5782 non-null   object
 4   domestic_gross     5782 non-null   object
 5   worldwide_gross    5782 non-null   object
dtypes: int64(1), object(5)
memory usage: 271.2+ KB

## 4.Data Wrangling

### 4.1 Dropping columns

#### 4.1.1 The movies dataframe

In [71]:
#dropping all the columns in the movies dataframe that are not relevant to the research

movies.drop(["genre_ids" , "id" ,"original_language" , "original_title" , "release_date"] ,axis=1, inplace = True )
movies.head()

,popularity,title,vote_average,vote_count
0,33.533,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,28.734,How to Train Your Dragon,7.7,7610
2,28.515,Iron Man 2,6.8,12368
3,28.005,Toy Story,7.9,10174
4,27.920,Inception,8.3,22186

In [76]:
#obtaining the shape of the movies dataframe

movies.shape

(26517, 4)

#### 4.1.2 The title basics dataframe

In [72]:
#dropping all the columns in the title basics dataframe that are not relevant

title_basics.drop(["tconst" , "primary_title" , "original_title", "start_year"] , axis=1 , inplace=True)
title_basics.head()

   runtime_minutes                genres
0            175.0    Action,Crime,Drama
1            114.0       Biography,Drama
2            122.0                 Drama
3              NaN          Comedy,Drama
4             80.0  Comedy,Drama,Fantasy

In [74]:
#obtaining the shape of the title_basics dataframe

title_basics.shape

(146144, 2)

#### 4.1.3 The movie_budgets.csv

In [73]:
#dropping all the columns in the movie budgets dataframe that are not relevant to the research

movie_budgets.drop(["id" , "release_date"] , axis=1 , inplace=True)
movie_budgets.head()

,movie,production_budget,domestic_gross,worldwide_gross
0,Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [75]:
#obtaining the shape of the movie budgets dataframe

movie_budgets.shape

(5782, 4)

The columns in the the datasets above have been dropped to make it easier to focus on the relevant columns which may improve the quality of the analysis.

### 4.2 Formatting Datatypes

#### 4.2.1 The movie budgets dataframe

In [80]:
#converting the production budget column datatype from object to integer

movie_budgets["production_budget"] = movie_budgets["production_budget"].str.replace("$" , "").str.replace("," , "")
movie_budgets["production_budget"] = movie_budgets["production_budget"].astype("int64")

In [81]:
#converting the domestic gross column datatype from object to integer

movie_budgets["domestic_gross"] = movie_budgets["domestic_gross"].str.replace("$", "").str.replace("," , "")
movie_budgets["domestic_gross"] = movie_budgets["domestic_gross"].astype("int64")

In [82]:
#converting the worldwide gross column datatype from object to integer

movie_budgets["worldwide_gross"] = movie_budgets["worldwide_gross"].str.replace("$","").str.replace(",", "")
movie_budgets["worldwide_gross"] = movie_budgets["worldwide_gross"].astype("int64")

In [83]:
#checking to see if the columns are in the correct data type

movie_budgets.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 4 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   movie              5782 non-null   object
 1   production_budget  5782 non-null   int64
 2   domestic_gross     5782 non-null   int64
 3   worldwide_gross    5782 non-null   int64
dtypes: int64(3), object(1)
memory usage: 180.8+ KB

The datatypes of the columns above have been converted from objects to integers to make it easier to conduct mathematical operations on them such as determining the ROI and also for easier comparisons.

### 4.3 Identifying and handling missing values

##### 4.3.1 The title basics dataset

In [84]:
#identifying missing values in the title basics dataframe

title_basics.isnull().sum()

runtime_minutes    31739
genres              5408
dtype: int64

In [85]:
#dropping the all the rows where the runtime value is null

title_basics.dropna(subset = "runtime_minutes" , axis=0 , inplace=True)

In [86]:
title_basics.shape

(114405, 2)

All the rows where the runtime value is null have been dropped inorder to reduce the number of entries in the dataset which may improve the quality of the analysis and also make sure that the runtime column have no missing values which may cause a bias in the analysis.

In [88]:
#replacing the missing values in the genres column with the string "other"

title_basics["genres"].fillna("other", inplace=True)

The missing values in the genres column have been replaced with the string "other" in order to treat the missing values as a separate category and hence include them in the analysis and visulizations.

### 4.4 Restructing data

#### 4.4.1 The title basics dataset

In [90]:
#keeping only the first value that appears in each row of the genres column and dropping the rest

title_basics["genres"] = title_basics["genres"].str.split(",").str[0]
title_basics.head()

   runtime_minutes     genres
0            175.0     Action
1            114.0  Biography
2            122.0      Drama
4             80.0     Comedy
5             75.0     Comedy

All the values in each row of the genre column that do not appear first have been dropped.This helps to simplify the data and reduce the number of unique values in the column hence easier visualization and analysis.